app/Http/Controllers/CateTtPhongthuyController.php

    public function edit($id)
    {
        $cateData = $this->_cate->getDataMenu();

        $cateParent = DB::table('cate_tt_phongthuys')
            ->leftjoin('child_tt_phongthuys', 'cate_tt_phongthuys.id', '=', 'child_tt_phongthuys.cateParen_id')
            ->select('name', 'metaName', 'description', 'lvl', 'child_tt_phongthuys.cateParen_id')
            ->where('child_tt_phongthuys.cateParen_id', '=', $id)
            //first get value object
            ->get()->first();
---
select `name`, `metaName`, `description`, `lvl`, `child_tt_phongthuys`.`cateParen_id` from `cate_tt_phongthuys` left join `child_tt_phongthuys` on `cate_tt_phongthuys`.`id` = `child_tt_phongthuys`.`cateParen_id` where `child_tt_phongthuys`.`cateParen_id` = '6'