app/Http/Controllers/FlexshopController.php

select `cate`.`name`, `cate`.`alias`, `cate`.`weight` from `cate_prods` as `cate` left join `child_prods` as `chil` on `cate`.`id` = `chil`.`id` where `chil`.`lvl` = '0' order by `cate`.`weight` desc
select * from `systems` limit 1
---
    public function __construct()
    {
        $htmlCateProd = "";
        //TODO menu products - san pham
        $cateParent = DB::table('cate_prods as cate')
            ->leftjoin('child_prods as chil', 'cate.id', '=', 'chil.id')
            ->select('cate.name', 'cate.alias','cate.weight')
            ->where('chil.lvl', 0)
            ->orderBy('cate.weight','desc')
            ->get();
        foreach ($cateParent as $cate) {
            if ($cate) {
                $htmlCateProd .= '<li class=" col-xs-12 col-sm-6">';
                $htmlCateProd .= '<a href="' . route('cateListProduct', $cate->alias) . '">' . $cate->name . '</a>';
                $htmlCateProd .= '</li>';
            }
        }
        //TODO System
        $getSystem = DB::table('systems')
            ->first();

select `name`, `addSlug`, `images`, `weight` from `sliders` where `active` = '1' order by `weight` desc
---
    public function index()
    {
        $htmlFeatureProject = '';
        $htmlFeatureProduct = '';
        $htmlFeatureThietke = '';
        $htmlFeatureNoithat = '';
        $htmlSlider = '';
        $htmlLoaiSp = '';
        $htmlNews = '';
        $htmlFengshui = '';
        $htmlPartner = '';
        $htmlNewNews = '';
        $htmlChungcu = '';
        $htmlNhapho = '';
        //TODO get Slider
        $getSlider = DB::table('sliders')
            ->select('name', 'addSlug', 'images', 'weight')
            ->where('active', 1)
            ->orderBy('weight', 'desc')
            ->get();

select `cate`.`id` as `cateID`, `cate`.`alias` as `cateSLug`, `cate`.`name`, `ne`.`id`, `ne`.`title`, `ne`.`images`, `ne`.`alias` from `news` as `ne` left join `categories` as `cate` on `ne`.`Cate_id` = `cate`.`id` where (`ne`.`active` = '1' and `ne`.`hot` = '1') order by `id` desc
---
        }

        //TODO get Feature Projects
        $getDataProject = DB::table('news as ne')
            ->leftjoin('categories as cate', 'ne.Cate_id', '=', 'cate.id')
            ->select('cate.id as cateID', 'cate.alias as cateSLug', 'cate.name', 'ne.id', 'ne.title', 'ne.images', 'ne.alias')
            ->where([
                ['ne.active', 1],
                ['ne.hot', 1]
            ])
            ->orderBy('id', 'desc')
            ->get();

select `cate`.`id` as `cateID`, `cate`.`alias` as `cateSLug`, `cate`.`name`, `ne`.`id`, `ne`.`title`, `ne`.`images`, `ne`.`alias`, `ne`.`prices` from `products` as `ne` left join `cate_prods` as `cate` on `ne`.`Cate_id` = `cate`.`id` where (`ne`.`active` = '1' and `ne`.`hot` = '1') order by `id` desc limit 7
select `cate`.`id` as `cateID`, `cate`.`alias` as `cateSLug`, `cate`.`name`, `ne`.`id`, `ne`.`title`, `ne`.`images`, `ne`.`alias` from `news` as `ne` left join `categories` as `cate` on `ne`.`Cate_id` = `cate`.`id` where (`ne`.`active` = '1' and `ne`.`feature` = '1' and `cate`.`id` = '10') order by `sort` desc
---
            $htmlFeatureProject .= '</div>';
        }
        //TODO Feature Products
        $getDataProduct = DB::table('products as ne')
            ->leftjoin('cate_prods as cate', 'ne.Cate_id', '=', 'cate.id')
            ->select('cate.id as cateID', 'cate.alias as cateSLug', 'cate.name', 'ne.id', 'ne.title', 'ne.images', 'ne.alias', 'ne.prices')
            ->where([
                ['ne.active', 1],
                ['ne.hot', 1]
            ])
            ->orderBy('id', 'desc')
            ->take(7)
            ->get();
        $htmlFeatureProduct = $this->showProducts($getDataProduct);
        //TODO feature du an thiet ke
        $getDataThietke = DB::table('news as ne')
            ->leftjoin('categories as cate', 'ne.Cate_id', '=', 'cate.id')
            ->select('cate.id as cateID', 'cate.alias as cateSLug', 'cate.name', 'ne.id', 'ne.title', 'ne.images', 'ne.alias')
            ->where([
                ['ne.active', 1],
                ['ne.feature', 1],
                ['cate.id', 10]
            ])
            ->orderBy('sort', 'desc')
            ->get();

select `cate`.`id` as `cateID`, `cate`.`alias` as `cateSLug`, `cate`.`name`, `ne`.`id`, `ne`.`title`, `ne`.`images`, `ne`.`alias` from `news` as `ne` left join `categories` as `cate` on `ne`.`Cate_id` = `cate`.`id` where (`ne`.`active` = '1' and `ne`.`feature` = '1' and `cate`.`id` = '11') order by `sort` desc
---
            $htmlFeatureThietke .= '</div>';
        }
        //TODO feature du an thi cong noi that
        $getDataNoithat = DB::table('news as ne')
            ->leftjoin('categories as cate', 'ne.Cate_id', '=', 'cate.id')
            ->select('cate.id as cateID', 'cate.alias as cateSLug', 'cate.name', 'ne.id', 'ne.title', 'ne.images', 'ne.alias')
            ->where([
                ['ne.active', 1],
                ['ne.feature', 1],
                ['cate.id', 11]
            ])
            ->orderBy('sort', 'desc')
            ->get();

select * from `cate_prods` as `cate` left join `child_prods` as `chil` on `chil`.`cateParen_id` = `cate`.`id` where `lvl` <> '0'
---
            $htmlFeatureNoithat .= '</div>';
        }
        //TODO get Loai San Pham
        $getCateProd = DB::table('cate_prods as cate')
            ->leftjoin('child_prods as chil', 'chil.cateParen_id', '=', 'cate.id')
            ->where('lvl', '<>', 0)
            ->get();

select `id`, `images`, `title`, `alias`, `view` from `fengshuis` where (`active` = '1' and `Cate_id` = '1') limit 3
---
                    }
                }*/
        //TODO Feng shui
        $getFeng = DB::table('fengshuis')
            ->select('id', 'images', 'title', 'alias', 'view')
            ->where([
                ['active', 1],
                ['Cate_id', 1]
            ])->take(3)
            ->get();

select `id`, `images`, `title`, `alias`, `view` from `fengshuis` where (`active` = '1' and `Cate_id` = '2') limit 3
---
            }
        }
        //TODO Feng shui phong thuy
        $getFengshui = DB::table('fengshuis')
            ->select('id', 'images', 'title', 'alias', 'view')
            ->where([
                ['active', 1],
                ['Cate_id', 2]
            ])->take(3)
            ->get();

select * from `partners` where `active` = '1'
---
            }
        }
        //TODO slider footer
        $getPartner = DB::table('partners')->where('active', 1)->get();

select `id`, `title`, `alias`, `summary`, `images` from `fengshuis` where `active` = '1' order by `id` desc
---
        }

        //TODO get Feng Shui
        $getNewsFeng = DB::table('fengshuis')
            ->select('id', 'title', 'alias', 'summary', 'images')
            ->where('active', 1)
            ->orderBy('id', 'desc')
            ->get();

select `fur`.`id`, `images`, `fur`.`alias`, `title` from `furniture` as `fur` right join `cate_furs` as `cate` on `fur`.`Cate_id` = `cate`.`id` where (`cate`.`id` = '3' and `active` = '1' and `feature` = '1')
---
        }

        //TODO get noi bat chung cu
        $getChungcu = DB::table('furniture as fur')
            ->rightjoin('cate_furs as cate', 'fur.Cate_id', '=', 'cate.id')
            ->select('fur.id', 'images', 'fur.alias', 'title')
            ->where([
                ['cate.id', 3],
                ['active', 1],
                ['feature', 1]
            ])
            ->get();

select `fur`.`id`, `images`, `fur`.`alias`, `title` from `furniture` as `fur` right join `cate_furs` as `cate` on `fur`.`Cate_id` = `cate`.`id` where (`cate`.`id` = '4' and `active` = '1' and `feature` = '1')
---
            }
        }
        //TODO get noi bat nha pho
        $getNhapho = DB::table('furniture as fur')
            ->rightjoin('cate_furs as cate', 'fur.Cate_id', '=', 'cate.id')
            ->select('fur.id', 'images', 'fur.alias', 'title')
            ->where([
                ['cate.id', 4],
                ['active', 1],
                ['feature', 1]
            ])
            ->get();

select * from `systems` limit 1
select `cate`.`name`, `cate`.`alias`, `chil`.`cateParen_id`, `chil`.`lvl` from `cate_prods` as `cate` left join `child_prods` as `chil` on `cate`.`id` = `chil`.`cateParen_id` where `chil`.`lvl` = '0'
select `cate`.`name`, `cate`.`alias`, `chil`.`lvl`, `prod`.`id`, `prod`.`title`, `prod`.`alias`, `prod`.`images`, `prod`.`prices`, `prod`.`discount`, `prod`.`feature`, `prod`.`Cate_id` from `cate_prods` as `cate` left join `child_prods` as `chil` on `cate`.`id` = `chil`.`cateParen_id` inner join `products` as `prod` on `cate`.`id` = `prod`.`Cate_id`
---
            }
        }
        //TODO social facebook youtube
        $getSocial = DB::table('systems')->first();
        /*
         * get slide show product
         */
        $getCateProdId = DB::table('cate_prods as cate')
            ->leftjoin('child_prods as chil', 'cate.id', '=', 'chil.cateParen_id')
            ->select('cate.name', 'cate.alias', 'chil.cateParen_id', 'chil.lvl')
            ->where('chil.lvl', '=', 0)
            ->get()
            ->toArray();
        $getSubAndProd = DB::table('cate_prods as cate')
            ->leftjoin('child_prods as chil', 'cate.id', '=', 'chil.cateParen_id')
            ->join('products as prod', 'cate.id', '=', 'prod.Cate_id')
            ->select('cate.name', 'cate.alias', 'chil.lvl', 'prod.id', 'prod.title', 'prod.alias', 'prod.images', 'prod.prices', 'prod.discount', 'prod.feature', 'prod.Cate_id')
            ->get()
            ->toArray();