app/Repositories/CateTtPhongthuy/CateTtPhongthuyEloquentRepository.php

    public function getDataMenu()
    {
        $cate = DB::table('cate_tt_phongthuys')
            ->leftjoin('child_tt_phongthuys', 'cate_tt_phongthuys.id', '=', 'child_tt_phongthuys.cateParen_id')
            ->select('name', 'lvl', 'alias', 'metaName', 'description', 'weight', 'child_tt_phongthuys.cateParen_id')
            ->get();
---
select `name`, `lvl`, `alias`, `metaName`, `description`, `weight`, `child_tt_phongthuys`.`cateParen_id` from `cate_tt_phongthuys` left join `child_tt_phongthuys` on `cate_tt_phongthuys`.`id` = `child_tt_phongthuys`.`cateParen_id`

    public function getCreateAndEdit($inputFile, $id = 0)
    {
        if ($id == 0) {
            $cateData = new CateTtPhongthuy();
            if (!empty($inputFile['txtName'])) {
                $cateData->name = $inputFile['txtName'];
                $cateData->alias = changeTitle($inputFile['txtName']);
            }
            if (!empty($inputFile['txtMeta'])) {
                $cateData->metaName = $inputFile['txtMeta'];
            } else {
                $cateData->metaName = $inputFile['txtName'];
            }
            if (!empty($inputFile['txtDescription'])) {
                $cateData->description = $inputFile['txtDescription'];
            }
            $cateData->save();
            $cateChildData = new ChildTtPhongthuy();
            $cateChildData->cateParen_id = $cateData->id;
            if (!empty($inputFile['slMenu'])) {
                $cateChildData->lvl = $inputFile['slMenu'];
            } else {
                $cateChildData->lvl = 0;
            }
            $cateChildData->save();
            return redirect()->route('catefengshui.index')->with('thongbao', 'Danh mục tạo thành công');
        } else {
            $cateData = CateTtPhongthuy::find($id);
---
insert into `cate_tt_phongthuys` (`name`, `alias`, `metaName`, `description`, `updated_at`, `created_at`) values ('Xe độ', 'xe-do', 'Xe độ', 'xe độ', '2019-05-05 05:35:18', '2019-05-05 05:35:18')
insert into `child_tt_phongthuys` (`cateParen_id`, `lvl`, `updated_at`, `created_at`) values ('3', '0', '2019-05-05 05:35:18', '2019-05-05 05:35:18')
select * from `cate_tt_phongthuys` where `cate_tt_phongthuys`.`id` = '6' limit 1

                $cateData->description = $inputFile['txtDescription'];
            }
            $cateData->save();
            $getIdChild = DB::table('cate_tt_phongthuys as cate')
                ->leftjoin('child_tt_phongthuys as child','cate.id','=','child.cateParen_id')
                ->where('child.cateParen_id',$id)
                ->get()
                ->first();
---
select * from `cate_tt_phongthuys` as `cate` left join `child_tt_phongthuys` as `child` on `cate`.`id` = `child`.`cateParen_id` where `child`.`cateParen_id` = '6'

    public function getDelete($id)
    {
        // bien kiem tra xem co phai la muc con ko, muc con != 0
        $categet = DB::table('child_tt_phongthuys')
            ->where('lvl',$id)
            ->count();
---
select count(*) as aggregate from `child_tt_phongthuys` where `lvl` = '6'